#include "enums.h"
#include "common.h"
#include "battle.h"
#include "megastruct.h"

struct ov_03_unk_struct_0 {
    void* field0_0x0;
    void* field1_0x4;
    struct megastruct* megastruct_ptr;
    uint field3_0xc;
    ushort field4_0x10;
    undefined field5_0x12;
    undefined field6_0x13;
    undefined4 field7_0x14;
    undefined4 field8_0x18;
    undefined4 field9_0x1c;
    undefined4 field10_0x20;
    undefined4 field11_0x24;
    undefined4 field12_0x28;
    undefined4 field13_0x2c;
    undefined4 field14_0x30;
    undefined4 field15_0x34;
    undefined4 field16_0x38;
    undefined4 field17_0x3c;
    undefined4 field18_0x40;
    undefined4 field19_0x44[4];
    undefined4 field20_0x54;
    undefined4 field21_0x58;
    undefined4 field22_0x5c;
    undefined4 field23_0x60;
    undefined4 field24_0x64;
    undefined4 field25_0x68;
    undefined4 field26_0x6c;
    undefined4 field27_0x70;
    undefined4 field28_0x74;
    undefined4 field29_0x78;
    undefined4 field30_0x7c;
    undefined4 field31_0x80;
    undefined4 field32_0x84;
    undefined4 field33_0x88;
    undefined4* field34_0x8c;
    undefined4* field35_0x90;
    undefined field36_0x94;
    undefined field37_0x95;
    ushort field38_0x96;
    undefined4 field39_0x98;
    undefined4 field40_0x9c;
    undefined4 field41_0xa0;
    undefined4 field42_0xa4;
    undefined4 field43_0xa8;
    undefined4 field44_0xac;
    int field45_0xb0;
    undefined4 field46_0xb4;
    undefined4 field47_0xb8;
    undefined4 field48_0xbc;
    undefined4 field49_0xc0;
    undefined4 field50_0xc4;
    undefined4 field51_0xc8;
    undefined4 field52_0xcc;
    undefined4 field53_0xd0;
    undefined4 field54_0xd4;
    undefined4 field55_0xd8;
    undefined4 field56_0xdc;
    undefined4 field57_0xe0;
    int field58_0xe4;
    undefined4 field59_0xe8;
    int* field60_0xec;
    int* field61_0xf0;
    int field62_0xf4;
    byte field63_0xf8;
    undefined field64_0xf9;
    undefined field65_0xfa;
    undefined field66_0xfb;
    undefined4 field67_0xfc;
};
ASSERT_SIZE(struct ov_03_unk_struct_0, 256);

struct ov_03_unk_struct_1 {
    void* field0_0x0;
    undefined4 unk_struct_size_0x1ac;
    struct megastruct* megastruct_ptr;
    ushort field3_0xc;
    ushort field4_0xe;
    ushort field5_0x10;
    undefined field6_0x12;
    undefined field7_0x13;
    undefined4 field8_0x14;
    undefined4 field9_0x18;
    undefined4 field10_0x1c;
    undefined4 field11_0x20;
    undefined4 field12_0x24;
    undefined4 field13_0x28;
    int unk_struct_size_0x44;
    undefined4* field15_0x30;
    int field16_0x34;
    int field17_0x38;
};
ASSERT_SIZE(struct ov_03_unk_struct_1, 60);

struct ov_03_unk_struct_2 {
    void* field0_0x0;
    void* unk_struct_size_0x1ac;
    struct megastruct* megastruct_ptr;
    ushort field3_0xc;
    ushort field4_0xe;
    undefined4 field5_0x10;
    undefined4 field6_0x14;
    undefined4 field7_0x18;
    int field8_0x1c;
    undefined4 field9_0x20;
    undefined4 field10_0x24;
    int field11_0x28;
    undefined4* field12_0x2c;
    int* field13_0x30;
    int* field14_0x34;
};
ASSERT_SIZE(struct ov_03_unk_struct_2, 56);

struct ov_03_unk_struct_3 {
    void* field0_0x0;
    byte field1_0x4;
    byte field2_0x5;
    undefined1 field3_0x6;
    char field4_0x7;
    byte field5_0x8;
    undefined field6_0x9;
    undefined field7_0xa;
    undefined field8_0xb;
    undefined4 field9_0xc;
    undefined4 field10_0x10;
    undefined4 field11_0x14;
    undefined4 field12_0x18;
    undefined4 field13_0x1c;
    undefined4 field14_0x20;
    undefined4 field15_0x24;
    undefined field16_0x28;
    undefined field17_0x29;
    undefined field18_0x2a;
    undefined field19_0x2b;
    undefined4 field20_0x2c;
    undefined4 field21_0x30[7]; // May be larger
    undefined4 field22_0x4c[7]; // Table may be larger
    undefined field23_0x68[22];
    undefined field24_0x7e;
    undefined field25_0x7f;
    struct megastruct* megastruct_ptr;
    undefined4 unk_struct_size_0x1ac;
    undefined field28_0x88;
    undefined field29_0x89;
    undefined field30_0x8a;
    undefined field31_0x8b;
    undefined4 field32_0x8c;
    undefined4 field33_0x90;
    undefined4 field34_0x94;
    int field35_0x98;
    undefined field36_0x9c;
    undefined field37_0x9d;
    undefined field38_0x9e;
    undefined field39_0x9f;
    int field40_0xa0;
    undefined4 field41_0xa4;
    undefined4 field42_0xa8;
    undefined field43_0xac;
    undefined field44_0xad;
    undefined field45_0xae;
    undefined field46_0xaf;
    undefined4 field47_0xb0;
    undefined4 field48_0xb4;
    undefined4 field49_0xb8;
    undefined4 field50_0xbc[4];
    undefined field51_0xcc[240];
    int field291_0x1bc;
    int field292_0x1c0;
    int field293_0x1c4;
    int field294_0x1c8;
    int field295_0x1cc;
    int field296_0x1d0;
    int field297_0x1d4;
    int field298_0x1d8;
    int field299_0x1dc;
};
ASSERT_SIZE(struct ov_03_unk_struct_3, 480);

struct ov_03_unk_struct_4 {
    void* field0_0x0;
    int* field1_0x4;
    int field2_0x8;
    int field3_0xc;
    int field4_0x10;
    undefined field5_0x14[2052];
    int field2057_0x818;
    undefined field2058_0x81c[1580];
    int field3638_0xe48;
    int field3639_0xe4c;
    int field3640_0xe50;
    undefined field3641_0xe54[620];
    int field4261_0x10c0;
    undefined4 field4262_0x10c4[128][2];
    uint field4263_0x14c4;
    undefined1 field4264_0x14c8;
    undefined1 field4265_0x14c9;
    undefined field4266_0x14ca;
    undefined field4267_0x14cb;
    undefined4* field4268_0x14cc;
    undefined1 field4269_0x14d0;
    undefined field4270_0x14d1;
    undefined field4271_0x14d2;
    undefined field4272_0x14d3;
};
ASSERT_SIZE(struct ov_03_unk_struct_4, 5332);

struct ov_04_unk_struct {
    void* field0_0x0;
    struct megastruct* megastruct_ptr;
    int field2_0x8;
    undefined field3_0xc;
    undefined field4_0xd;
    undefined field5_0xe;
    undefined field6_0xf;
    undefined field7_0x10;
    undefined field8_0x11;
    undefined field9_0x12;
    undefined field10_0x13;
    undefined field11_0x14;
    undefined field12_0x15;
    undefined field13_0x16;
    undefined field14_0x17;
    undefined field15_0x18;
    undefined field16_0x19;
    undefined field17_0x1a;
    undefined field18_0x1b;
    undefined field19_0x1c;
    undefined field20_0x1d;
    undefined field21_0x1e;
    undefined field22_0x1f;
    int field23_0x20;
    int field24_0x24;
    int field25_0x28;
    int field26_0x2c;
};
ASSERT_SIZE(struct ov_04_unk_struct, 48);

struct ov_05_unk_struct {
    void* field0_0x0;
    undefined field1_0x4;
    undefined field2_0x5;
    undefined field3_0x6;
    undefined field4_0x7;
    undefined field5_0x8;
    undefined field6_0x9;
    undefined field7_0xa;
    undefined field8_0xb;
    undefined field9_0xc;
    undefined field10_0xd;
    undefined field11_0xe;
    undefined field12_0xf;
    struct megastruct* megastruct_ptr;
    undefined4 field14_0x14;
    undefined4 field15_0x18;
    undefined field16_0x1c;
    undefined field17_0x1d;
    undefined field18_0x1e;
    undefined field19_0x1f;
    undefined field20_0x20;
    undefined field21_0x21;
    undefined field22_0x22;
    undefined field23_0x23;
    undefined4 maybe_field24_0x24; // This field is written to, but is not accounted for in the
                                   // MaybeMemAlloc...
};
ASSERT_SIZE(struct ov_05_unk_struct, 40); // May only be 36

struct ov_06_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined field3_0xc;
    undefined field4_0xd;
    undefined field5_0xe;
    undefined field6_0xf;
    undefined field7_0x10;
    undefined field8_0x11;
    undefined field9_0x12;
    undefined field10_0x13;
    undefined field11_0x14;
    undefined field12_0x15;
    undefined field13_0x16;
    undefined field14_0x17;
    undefined field15_0x18;
    undefined field16_0x19;
    undefined field17_0x1a;
    undefined field18_0x1b;
    undefined field19_0x1c;
    undefined field20_0x1d;
    undefined field21_0x1e;
    undefined field22_0x1f;
    undefined field23_0x20;
    undefined field24_0x21;
    undefined field25_0x22;
    undefined field26_0x23;
    undefined field27_0x24;
    undefined field28_0x25;
    undefined field29_0x26;
    undefined field30_0x27;
    undefined field31_0x28;
    undefined field32_0x29;
    undefined field33_0x2a;
    undefined field34_0x2b;
    undefined field35_0x2c;
    undefined field36_0x2d;
    undefined field37_0x2e;
    undefined field38_0x2f;
    undefined field39_0x30;
    undefined field40_0x31;
    undefined field41_0x32;
    undefined field42_0x33;
    undefined field43_0x34;
    undefined field44_0x35;
    undefined field45_0x36;
    undefined field46_0x37;
    undefined field47_0x38;
    undefined field48_0x39;
    undefined field49_0x3a;
    undefined field50_0x3b;
    undefined field51_0x3c;
    undefined field52_0x3d;
    undefined field53_0x3e;
    undefined field54_0x3f;
    undefined field55_0x40;
    undefined field56_0x41;
    undefined field57_0x42;
    undefined field58_0x43;
    undefined field59_0x44;
    undefined field60_0x45;
    undefined field61_0x46;
    undefined field62_0x47;
    undefined field63_0x48;
    undefined field64_0x49;
    undefined field65_0x4a;
    undefined field66_0x4b;
    undefined field67_0x4c;
    undefined field68_0x4d;
    undefined field69_0x4e;
    undefined field70_0x4f;
    undefined field71_0x50;
    undefined field72_0x51;
    undefined field73_0x52;
    undefined field74_0x53;
    undefined field75_0x54;
    undefined field76_0x55;
    undefined field77_0x56;
    undefined field78_0x57;
    undefined field79_0x58;
    undefined field80_0x59;
    undefined field81_0x5a;
    undefined field82_0x5b;
    undefined field83_0x5c;
    undefined field84_0x5d;
    undefined field85_0x5e;
    undefined field86_0x5f;
    undefined field87_0x60;
    undefined field88_0x61;
    undefined field89_0x62;
    undefined field90_0x63;
    undefined field91_0x64;
    undefined field92_0x65;
    undefined field93_0x66;
    undefined field94_0x67;
    undefined field95_0x68;
    undefined field96_0x69;
    undefined field97_0x6a;
    undefined field98_0x6b;
    undefined field99_0x6c;
    undefined field100_0x6d;
    undefined field101_0x6e;
    undefined field102_0x6f;
    struct megastruct* megastruct_ptr;
    undefined4 field104_0x74;
    undefined field105_0x78;
    undefined field106_0x79;
    undefined field107_0x7a;
    undefined field108_0x7b;
    undefined field109_0x7c;
    undefined field110_0x7d;
    undefined field111_0x7e;
    undefined field112_0x7f;
    undefined field113_0x80;
    undefined field114_0x81;
    undefined field115_0x82;
    undefined field116_0x83;
    undefined4 field117_0x84;
    undefined4 field118_0x88;
};
ASSERT_SIZE(struct ov_08_unk_struct, 140);

struct ov_07_unk_struct {
    void* field0_0x0;
    struct megastruct* megastruct_ptr;
    undefined4 field2_0x8;
};
ASSERT_SIZE(struct ov_07_unk_struct, 12);

struct ov_08_unk_struct {
    void* field0_0x0;
    undefined4 megastruct_ptr;
    undefined4 field2_0x8;
};
ASSERT_SIZE(struct ov_08_unk_struct, 12);

struct ov_09_unk_struct {
    void* field0_0x0;
    struct megastruct* megastruct_ptr;
    undefined4 field2_0x8;
};
ASSERT_SIZE(struct ov_09_unk_struct, 12);

struct ov_11_unk_struct_size_0x730 {
    ushort field0_0x0;
    undefined2 field1_0x2;
    undefined field2_0x4;
    undefined field3_0x5;
    undefined field4_0x6;
    undefined field5_0x7;
    int field6_0x8;
    int field7_0xc;
    int field8_0x10;
    int* field9_0x14;
    undefined field10_0x18;
    undefined field11_0x19;
    undefined field12_0x1a;
    undefined field13_0x1b;
    int field14_0x1c;
    int field15_0x20;
    undefined field16_0x24;
    undefined field17_0x25;
    undefined field18_0x26;
    undefined field19_0x27;
    undefined field20_0x28;
    undefined field21_0x29;
    undefined field22_0x2a;
    undefined field23_0x2b;
    undefined field24_0x2c;
    undefined field25_0x2d;
    undefined field26_0x2e;
    undefined field27_0x2f;
    undefined field28_0x30;
    undefined field29_0x31;
    undefined field30_0x32;
    undefined field31_0x33;
    ushort field32_0x34;
    undefined field33_0x36;
    undefined field34_0x37;
    int field35_0x38;
    byte field36_0x3c;
    undefined field37_0x3d;
    undefined field38_0x3e;
    undefined field39_0x3f;
    int field40_0x40;
    undefined4 field41_0x44;
    undefined4 field42_0x48[22];
    int field43_0xa0;
    int field44_0xa4;
    int field45_0xa8;
    int field46_0xac;
    int field47_0xb0;
    int field48_0xb4;
    undefined4 field49_0xb8;
    undefined4 field50_0xbc;
    undefined4 field51_0xc0;
    undefined4 field52_0xc4[3];
    int field53_0xd0;
    undefined field54_0xd4;
    undefined field55_0xd5;
    undefined field56_0xd6;
    undefined field57_0xd7;
    undefined4 field58_0xd8;
    int field59_0xdc;
    int field60_0xe0;
    int field61_0xe4;
    undefined4 field62_0xe8;
    undefined4 field63_0xec;
    undefined4 field64_0xf0;
    undefined4 field65_0xf4;
    undefined4 field66_0xf8[2];
    undefined4 field67_0x100[2];
    undefined1 field68_0x108;
    undefined field69_0x109;
    undefined field70_0x10a;
    undefined field71_0x10b;
    undefined field72_0x10c;
    undefined field73_0x10d;
    undefined field74_0x10e;
    undefined field75_0x10f;
    undefined field76_0x110;
    undefined field77_0x111;
    undefined field78_0x112;
    undefined field79_0x113;
    undefined field80_0x114;
    undefined field81_0x115;
    undefined field82_0x116;
    undefined field83_0x117;
    undefined field84_0x118;
    undefined field85_0x119;
    undefined field86_0x11a;
    undefined field87_0x11b;
    undefined field88_0x11c;
    undefined field89_0x11d;
    undefined field90_0x11e;
    undefined field91_0x11f;
    undefined1* field92_0x120;
    undefined field93_0x124;
    undefined field94_0x125;
    undefined field95_0x126;
    undefined field96_0x127;
    undefined field97_0x128;
    undefined field98_0x129;
    undefined field99_0x12a;
    undefined field100_0x12b;
    undefined field101_0x12c;
    undefined field102_0x12d;
    undefined field103_0x12e;
    undefined field104_0x12f;
    undefined field105_0x130;
    undefined field106_0x131;
    undefined field107_0x132;
    undefined field108_0x133;
    undefined field109_0x134;
    undefined field110_0x135;
    undefined field111_0x136;
    undefined field112_0x137;
    undefined field113_0x138;
    undefined field114_0x139;
    undefined field115_0x13a;
    undefined field116_0x13b;
    int field117_0x13c;
    int field118_0x140;
    undefined field119_0x144;
    undefined field120_0x145;
    undefined field121_0x146;
    undefined field122_0x147;
    undefined field123_0x148;
    undefined field124_0x149;
    undefined field125_0x14a;
    undefined field126_0x14b;
    undefined field127_0x14c;
    undefined field128_0x14d;
    undefined field129_0x14e;
    undefined field130_0x14f;
    undefined4 field131_0x150;
    undefined field132_0x154;
    undefined field133_0x155;
    undefined field134_0x156;
    undefined field135_0x157;
    int field136_0x158[2][34]; // May be bigger in one dimension. 34 is correct.
    undefined field137_0x268[192]; // May be part of the previous field.
    undefined4 field329_0x328[4];
    undefined field330_0x338;
    undefined field331_0x339;
    undefined field332_0x33a;
    undefined field333_0x33b;
    undefined4 field334_0x33c[2]; // may be larger
    undefined field335_0x344;
    undefined field336_0x345;
    undefined field337_0x346;
    undefined field338_0x347;
    undefined field339_0x348;
    undefined field340_0x349;
    undefined field341_0x34a;
    undefined field342_0x34b;
    undefined field343_0x34c;
    undefined field344_0x34d;
    undefined field345_0x34e;
    undefined field346_0x34f;
    undefined4 field347_0x350[2]; // may be larger
    undefined field348_0x358;
    undefined field349_0x359;
    undefined field350_0x35a;
    undefined field351_0x35b;
    undefined field352_0x35c;
    undefined field353_0x35d;
    undefined field354_0x35e;
    undefined field355_0x35f;
    undefined field356_0x360;
    undefined field357_0x361;
    undefined field358_0x362;
    undefined field359_0x363;
    int field360_0x364;
    undefined field361_0x368[320];
    int field681_0x4a8;
    int field682_0x4ac;
    int field683_0x4b0;
    int field684_0x4b4;
    undefined field685_0x4b8[100];
    int field785_0x51c;
    int field786_0x520;
    undefined4 field787_0x524;
    undefined field788_0x528;
    undefined field789_0x529;
    undefined field790_0x52a;
    undefined field791_0x52b;
    int field792_0x52c;
    undefined4 field793_0x530;
    undefined field794_0x534;
    undefined field795_0x535;
    undefined field796_0x536;
    undefined field797_0x537;
    undefined field798_0x538;
    undefined field799_0x539;
    undefined field800_0x53a;
    undefined field801_0x53b;
    undefined field802_0x53c;
    undefined field803_0x53d;
    undefined field804_0x53e;
    undefined field805_0x53f;
    undefined field806_0x540;
    undefined field807_0x541;
    undefined field808_0x542;
    undefined field809_0x543;
    undefined field810_0x544;
    undefined field811_0x545;
    undefined field812_0x546;
    undefined field813_0x547;
    undefined4 field814_0x548;
    undefined4 field815_0x54c;
    undefined field816_0x550;
    undefined field817_0x551;
    undefined field818_0x552;
    undefined field819_0x553;
    int field820_0x554;
    undefined4 field821_0x558;
    undefined4 field822_0x55c;
    undefined field823_0x560;
    undefined field824_0x561;
    undefined field825_0x562;
    undefined field826_0x563;
    undefined field827_0x564;
    undefined field828_0x565;
    undefined field829_0x566;
    undefined field830_0x567;
    undefined field831_0x568;
    undefined field832_0x569;
    undefined field833_0x56a;
    undefined field834_0x56b;
    undefined field835_0x56c;
    undefined field836_0x56d;
    undefined field837_0x56e;
    undefined field838_0x56f;
    undefined field839_0x570;
    undefined field840_0x571;
    undefined field841_0x572;
    undefined field842_0x573;
    undefined field843_0x574;
    undefined field844_0x575;
    undefined field845_0x576;
    undefined field846_0x577;
    undefined field847_0x578;
    undefined field848_0x579;
    undefined field849_0x57a;
    undefined field850_0x57b;
    undefined field851_0x57c;
    undefined field852_0x57d;
    undefined field853_0x57e;
    undefined field854_0x57f;
    undefined field855_0x580;
    undefined field856_0x581;
    undefined field857_0x582;
    undefined field858_0x583;
    undefined4 field859_0x584[2]; // may be larger
    undefined field860_0x58c;
    undefined field861_0x58d;
    undefined field862_0x58e;
    undefined field863_0x58f;
    undefined field864_0x590;
    undefined field865_0x591;
    undefined field866_0x592;
    undefined field867_0x593;
    undefined field868_0x594;
    undefined field869_0x595;
    undefined field870_0x596;
    undefined field871_0x597;
    undefined field872_0x598;
    undefined field873_0x599;
    undefined field874_0x59a;
    undefined field875_0x59b;
    int field876_0x59c;
    undefined4 field877_0x5a0;
    int field878_0x5a4;
    int field879_0x5a8;
    undefined field880_0x5ac;
    undefined field881_0x5ad;
    undefined field882_0x5ae;
    undefined field883_0x5af;
    undefined field884_0x5b0;
    undefined field885_0x5b1;
    undefined field886_0x5b2;
    undefined field887_0x5b3;
    undefined field888_0x5b4;
    undefined field889_0x5b5;
    undefined field890_0x5b6;
    undefined field891_0x5b7;
    undefined field892_0x5b8;
    undefined field893_0x5b9;
    undefined field894_0x5ba;
    undefined field895_0x5bb;
    undefined field896_0x5bc;
    undefined field897_0x5bd;
    undefined field898_0x5be;
    undefined field899_0x5bf;
    undefined field900_0x5c0;
    undefined field901_0x5c1;
    undefined field902_0x5c2;
    undefined field903_0x5c3;
    undefined field904_0x5c4;
    undefined field905_0x5c5;
    undefined field906_0x5c6;
    undefined field907_0x5c7;
    undefined field908_0x5c8;
    undefined field909_0x5c9;
    undefined field910_0x5ca;
    undefined field911_0x5cb;
    undefined field912_0x5cc;
    undefined field913_0x5cd;
    undefined field914_0x5ce;
    undefined field915_0x5cf;
    undefined field916_0x5d0;
    undefined field917_0x5d1;
    undefined field918_0x5d2;
    undefined field919_0x5d3;
    undefined field920_0x5d4;
    undefined field921_0x5d5;
    undefined field922_0x5d6;
    undefined field923_0x5d7;
    undefined field924_0x5d8;
    undefined field925_0x5d9;
    undefined field926_0x5da;
    undefined field927_0x5db;
    undefined field928_0x5dc;
    undefined field929_0x5dd;
    undefined field930_0x5de;
    undefined field931_0x5df;
    undefined field932_0x5e0;
    undefined field933_0x5e1;
    undefined field934_0x5e2;
    undefined field935_0x5e3;
    undefined field936_0x5e4;
    undefined field937_0x5e5;
    undefined field938_0x5e6;
    undefined field939_0x5e7;
    undefined field940_0x5e8;
    undefined field941_0x5e9;
    undefined field942_0x5ea;
    undefined field943_0x5eb;
    undefined field944_0x5ec;
    undefined field945_0x5ed;
    undefined field946_0x5ee;
    undefined field947_0x5ef;
    undefined field948_0x5f0;
    undefined field949_0x5f1;
    undefined field950_0x5f2;
    undefined field951_0x5f3;
    undefined field952_0x5f4;
    undefined field953_0x5f5;
    undefined field954_0x5f6;
    undefined field955_0x5f7;
    undefined4 field956_0x5f8;
    undefined4 field957_0x5fc;
    undefined4 field958_0x600;
    undefined4 field959_0x604;
    int field960_0x608;
    int field961_0x60c[5];
    int field962_0x620;
    undefined field963_0x624;
    undefined field964_0x625;
    undefined field965_0x626;
    undefined field966_0x627;
    undefined field967_0x628;
    undefined field968_0x629;
    undefined field969_0x62a;
    undefined field970_0x62b;
    undefined field971_0x62c;
    undefined field972_0x62d;
    undefined field973_0x62e;
    undefined field974_0x62f;
    undefined field975_0x630;
    undefined field976_0x631;
    undefined field977_0x632;
    undefined field978_0x633;
    undefined field979_0x634;
    undefined field980_0x635;
    undefined field981_0x636;
    undefined field982_0x637;
    undefined field983_0x638;
    undefined field984_0x639;
    undefined field985_0x63a;
    undefined field986_0x63b;
    undefined field987_0x63c;
    undefined field988_0x63d;
    undefined field989_0x63e;
    undefined field990_0x63f;
    undefined field991_0x640;
    undefined field992_0x641;
    undefined field993_0x642;
    undefined field994_0x643;
    undefined field995_0x644;
    undefined field996_0x645;
    undefined field997_0x646;
    undefined field998_0x647;
    undefined field999_0x648;
    undefined field1000_0x649;
    undefined field1001_0x64a;
    undefined field1002_0x64b;
    undefined field1003_0x64c;
    undefined field1004_0x64d;
    undefined field1005_0x64e;
    undefined field1006_0x64f;
    int field1007_0x650;
    undefined field1008_0x654[172];
    int field1180_0x700;
    undefined field1181_0x704;
    undefined field1182_0x705;
    undefined field1183_0x706;
    undefined field1184_0x707;
    int field1185_0x708;
    undefined4 field1186_0x70c;
    int field1187_0x710;
    int field1188_0x714;
    int field1189_0x718;
    int field1190_0x71c;
    int field1191_0x720;
    int field1192_0x724;
    int field1193_0x728;
    struct megastruct* megastruct_ptr;
};
ASSERT_SIZE(struct ov_11_unk_struct_size_0x730, 0x730);

struct ov_11_unk_struct_0 {
    void* unk_fun_ptr;
    struct megastruct* megastruct_ptr;
    struct ov_11_unk_struct_size_0x730* unk_struct_size_0x730;
};
ASSERT_SIZE(struct ov_11_unk_struct_0, 12);

struct ov_11_unk_struct_1 {
    void* field0_0x0;
    undefined field1_0x4;
    undefined field2_0x5;
    undefined field3_0x6;
    undefined field4_0x7;
    undefined field5_0x8;
    undefined field6_0x9;
    undefined field7_0xa;
    undefined field8_0xb;
};
ASSERT_SIZE(struct ov_11_unk_struct_1, 12);

struct ov_11_unk_struct_2 {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined4 field3_0xc;
    undefined4 field4_0x10[3];
    undefined4 field5_0x1c;
    undefined4 field6_0x20;
    undefined4 field7_0x24;
};
ASSERT_SIZE(struct ov_11_unk_struct_2, 40);

struct ov_19_unk_struct {
    void* field0_0x0;
    undefined2 field1_0x4;
    undefined2 field2_0x6;
    undefined2 field3_0x8;
    undefined2 field4_0xa;
    undefined field5_0xc;
    undefined field6_0xd;
    undefined field7_0xe;
    undefined field8_0xf;
    undefined field9_0x10;
    undefined field10_0x11;
    undefined field11_0x12;
    undefined field12_0x13;
    undefined field13_0x14;
    undefined field14_0x15;
    undefined field15_0x16;
    undefined field16_0x17;
    undefined4 field17_0x18;
    undefined4 field18_0x1c;
    undefined field19_0x20;
    undefined field20_0x21;
    undefined field21_0x22;
    undefined field22_0x23;
    undefined field23_0x24;
    undefined field24_0x25;
    undefined field25_0x26;
    undefined field26_0x27;
    undefined field27_0x28;
    undefined field28_0x29;
    undefined field29_0x2a;
    undefined field30_0x2b;
    undefined field31_0x2c;
    undefined field32_0x2d;
    undefined field33_0x2e;
    undefined field34_0x2f;
    undefined field35_0x30;
    undefined field36_0x31;
    undefined field37_0x32;
    undefined field38_0x33;
    undefined field39_0x34;
    undefined field40_0x35;
    undefined field41_0x36;
    undefined field42_0x37;
    undefined field43_0x38;
    undefined field44_0x39;
    undefined field45_0x3a;
    undefined field46_0x3b;
    undefined field47_0x3c;
    undefined field48_0x3d;
    undefined field49_0x3e;
    undefined field50_0x3f;
    undefined field51_0x40;
    undefined field52_0x41;
    undefined field53_0x42;
    undefined field54_0x43;
    undefined field55_0x44;
    undefined field56_0x45;
    undefined field57_0x46;
    undefined field58_0x47;
    undefined field59_0x48;
    undefined field60_0x49;
    undefined field61_0x4a;
    undefined field62_0x4b;
    undefined field63_0x4c;
    undefined field64_0x4d;
    undefined field65_0x4e;
    undefined field66_0x4f;
    undefined field67_0x50;
    undefined field68_0x51;
    undefined field69_0x52;
    undefined field70_0x53;
    undefined field71_0x54;
    undefined field72_0x55;
    undefined field73_0x56;
    undefined field74_0x57;
    undefined field75_0x58;
    undefined field76_0x59;
    undefined field77_0x5a;
    undefined field78_0x5b;
    undefined field79_0x5c;
    undefined field80_0x5d;
    undefined field81_0x5e;
    undefined field82_0x5f;
    undefined field83_0x60;
    undefined field84_0x61;
    undefined field85_0x62;
    undefined field86_0x63;
    undefined field87_0x64;
    undefined field88_0x65;
    undefined field89_0x66;
    undefined field90_0x67;
    undefined field91_0x68;
    undefined field92_0x69;
    undefined field93_0x6a;
    undefined field94_0x6b;
    undefined field95_0x6c;
    undefined field96_0x6d;
    undefined field97_0x6e;
    undefined field98_0x6f;
    undefined field99_0x70;
    undefined field100_0x71;
    undefined field101_0x72;
    undefined field102_0x73;
    undefined field103_0x74;
    undefined field104_0x75;
    undefined field105_0x76;
    undefined field106_0x77;
    undefined field107_0x78;
    undefined field108_0x79;
    undefined field109_0x7a;
    undefined field110_0x7b;
};
ASSERT_SIZE(struct ov_19_unk_struct, 124);

struct ov_20_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined field3_0xc;
    undefined field4_0xd;
    undefined field5_0xe;
    undefined field6_0xf;
};
ASSERT_SIZE(struct ov_20_unk_struct, 16);

struct ov_21_unk_struct {
    void* field0_0x0;
    undefined field1_0x4;
    undefined field2_0x5;
    undefined field3_0x6;
    undefined field4_0x7;
    undefined4 field5_0x8;
    undefined4 field6_0xc;
    undefined4 field7_0x10;
    undefined field8_0x14;
    undefined field9_0x15;
    undefined field10_0x16;
    undefined field11_0x17;
    undefined field12_0x18;
    undefined field13_0x19;
    undefined field14_0x1a;
    undefined field15_0x1b;
    undefined4 field16_0x1c;
};
ASSERT_SIZE(struct ov_21_unk_struct, 32);

struct ov_22_unk_struct {
    void* field0_0x0;
    void* field1_0x4;
    undefined4 field2_0x8;
    undefined4 field3_0xc;
    undefined4 field4_0x10;
    undefined4 field5_0x14;
    undefined4 field6_0x18;
    undefined4 field7_0x1c;
    undefined field8_0x20;
    undefined field9_0x21;
    undefined field10_0x22;
    undefined field11_0x23;
    undefined field12_0x24;
    undefined field13_0x25;
    undefined field14_0x26;
    undefined field15_0x27;
    undefined4 field16_0x28;
    undefined4 field17_0x2c;
    int8_t field18_0x30;
    undefined field19_0x31;
    undefined field20_0x32;
    undefined field21_0x33;
    undefined field22_0x34;
    undefined field23_0x35;
    undefined field24_0x36;
    undefined field25_0x37;
    undefined4 field26_0x38;
    undefined4 field27_0x3c;
    undefined4 field28_0x40;
    undefined4 field29_0x44;
    undefined1 field30_0x48;
    undefined1 field31_0x49;
    undefined1 field32_0x4a;
    undefined1 field33_0x4b;
    undefined4 field34_0x4c;
    undefined field35_0x50[852];
    undefined4 field887_0x3a4;
    undefined field888_0x3a8;
    undefined field889_0x3a9;
    undefined field890_0x3aa;
    undefined field891_0x3ab;
    undefined field892_0x3ac;
    undefined field893_0x3ad;
    undefined field894_0x3ae;
    undefined field895_0x3af;
};
ASSERT_SIZE(struct ov_22_unk_struct, 944);

struct ov_23_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined field3_0xc;
    undefined field4_0xd;
    undefined field5_0xe;
    undefined field6_0xf;
    undefined4 field7_0x10;
    undefined4 field8_0x14;
    undefined field9_0x18;
    undefined field10_0x19;
    undefined field11_0x1a;
    undefined field12_0x1b;
    undefined field13_0x1c;
    undefined field14_0x1d;
    undefined field15_0x1e;
    undefined field16_0x1f;
    undefined field17_0x20;
    undefined field18_0x21;
    undefined field19_0x22;
    undefined field20_0x23;
    undefined field21_0x24;
    undefined field22_0x25;
    undefined field23_0x26;
    undefined field24_0x27;
    undefined field25_0x28;
    undefined field26_0x29;
    undefined field27_0x2a;
    undefined field28_0x2b;
    undefined field29_0x2c;
    undefined field30_0x2d;
    undefined field31_0x2e;
    undefined field32_0x2f;
    undefined field33_0x30;
    undefined field34_0x31;
    undefined field35_0x32;
    undefined field36_0x33;
    undefined field37_0x34;
    undefined field38_0x35;
    undefined field39_0x36;
    undefined field40_0x37;
    undefined field41_0x38;
    undefined field42_0x39;
    undefined field43_0x3a;
    undefined field44_0x3b;
    int unk_struct_size_0x1ac;
    undefined field46_0x40;
    undefined field47_0x41;
    undefined field48_0x42;
    undefined field49_0x43;
    undefined field50_0x44;
    undefined field51_0x45;
    undefined field52_0x46;
    undefined field53_0x47;
    undefined field54_0x48;
    undefined field55_0x49;
    undefined field56_0x4a;
    undefined field57_0x4b;
    undefined field58_0x4c;
    undefined field59_0x4d;
    undefined field60_0x4e;
    undefined field61_0x4f;
    undefined field62_0x50;
    undefined field63_0x51;
    undefined field64_0x52;
    undefined field65_0x53;
    undefined field66_0x54;
    undefined field67_0x55;
    undefined field68_0x56;
    undefined field69_0x57;
    undefined field70_0x58;
    undefined field71_0x59;
    undefined field72_0x5a;
    undefined field73_0x5b;
    struct ranger_data* ranger_data_ptr;
    undefined field75_0x60;
    undefined field76_0x61;
    undefined field77_0x62;
    undefined field78_0x63;
    undefined field79_0x64;
    undefined field80_0x65;
    undefined field81_0x66;
    undefined field82_0x67;
};
ASSERT_SIZE(struct ov_23_unk_struct, 104);

struct ov_24_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined4 field3_0xc;
    undefined4 field4_0x10;
};
ASSERT_SIZE(struct ov_24_unk_struct, 20);

struct ov_25_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4 field2_0x8;
    undefined4 field3_0xc;
    undefined4 field4_0x10;
    undefined4 field5_0x14;
    undefined4 field6_0x18;
    undefined field7_0x1c;
    undefined field8_0x1d;
    undefined field9_0x1e;
    undefined field10_0x1f;
    undefined field11_0x20;
    undefined field12_0x21;
    undefined field13_0x22;
    undefined field14_0x23;
    undefined4 field15_0x24;
    undefined field16_0x28;
    undefined field17_0x29;
    undefined field18_0x2a;
    undefined field19_0x2b;
    undefined4 field20_0x2c;
    undefined4 field21_0x30;
};
ASSERT_SIZE(struct ov_25_unk_struct, 52);

struct ov_27_unk_struct {
    void* field0_0x0;
    undefined4 field1_0x4;
    undefined4* field2_0x8;
    undefined4* field3_0xc;
    undefined4 field4_0x10;
    undefined field5_0x14[864];
    undefined4 field869_0x374;
    undefined field870_0x378;
    undefined field871_0x379;
    undefined field872_0x37a;
    undefined field873_0x37b;
    undefined field874_0x37c;
    undefined field875_0x37d;
    undefined field876_0x37e;
    undefined field877_0x37f;
    undefined field878_0x380;
    undefined field879_0x381;
    undefined field880_0x382;
    undefined field881_0x383;
    undefined4 field882_0x384;
    undefined field883_0x388[4828];
};
ASSERT_SIZE(struct ov_27_unk_struct, 5732);

struct ov_28_unk_struct {
    void* field0_0x0;
    struct megastruct* megastruct_ptr;
    undefined4 field2_0x8;
};
ASSERT_SIZE(struct ov_28_unk_struct, 12);
